package Module6;
/*
 * Задание 1:
 * Реализовать классы, которые будут представлять собой разные виды клиентов банка:
 * единый абстрактный класс Client и классы для физических лиц, юридических лиц и
 * индивидуальных предпринимателей, которые от этого класса наследуются. У каждого
 * клиента должен быть расчетный счет. Для физических лиц снятие с лицевого счета
 * без комиссии, для юридических лиц снятие облагалось комиссией в 1%, а для
 * индивидуальных предпринимателей пополнение облагалось комиссией 1%, если сумма
 * пополнения меньше 1000 р и 0,5%, если сумма ровна или больше 1000 р
 */

public class Individual extends Client{
}
